In [1]:
import pandas as pd

In [2]:
pd.Series([4,7,-5,3],index=['d','b','a','c'])

d    4
b    7
a   -5
c    3
dtype: int64

In [3]:
data={'state':['Ohio','Ohio','Ohio','Nevada','Nevada'],
     'year':[2000,2001,2002,2001,2002],
     'pop':[1.5,1.7,3.6,2.4,2.9]}
pd.DataFrame(data,columns=['year','state','pop'],
            index=['one','two','three','four','five'])

       year   state  pop
one    2000    Ohio  1.5
two    2001    Ohio  1.7
three  2002    Ohio  3.6
four   2001  Nevada  2.4
five   2002  Nevada  2.9

In [5]:
Location='csv_ex.csv'
df_csv=pd.read_csv(Location,names=['Names','Births'])

In [6]:
df_csv.head()

     Names  Births
0      Bob     968
1  Jessica     155
2     Mary      77
3     John     578
4      Mel     973

In [7]:
Location='excel_ex.xlsx'
df_excel=pd.read_excel(Location,0,header=0)
df_excel.head()

      name  income  age  height
0      Bob     968   60     170
1  Jessica     155   40     166
2     Mary      77   35     183
3     John     578   55     150
4      Mel     973   30     190

In [8]:
df_excel.to_csv('data2.csv',index=False)

In [9]:
df_excel.to_csv('data3.csv',index=True)

In [10]:
df_excel.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   income  5 non-null      int64
 2   age     5 non-null      int64
 3   height  5 non-null      int64
dtypes: int64(3), object(1)
memory usage: 288.0+ bytes

In [11]:
df_excel.describe()

           income        age      height
count    5.000000   5.000000    5.000000
mean   550.200000  44.000000  171.800000
std    428.424672  12.942179   15.562776
min     77.000000  30.000000  150.000000
25%    155.000000  35.000000  166.000000
50%    578.000000  40.000000  170.000000
75%    968.000000  55.000000  183.000000
max    973.000000  60.000000  190.000000

In [12]:
df_excel.new_var=df_excel.age/10

C:\Users\hanyo\AppData\Local\Temp\ipykernel_8440\3254701149.py:1: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  df_excel.new_var=df_excel.age/10

In [13]:
df_excel

      name  income  age  height
0      Bob     968   60     170
1  Jessica     155   40     166
2     Mary      77   35     183
3     John     578   55     150
4      Mel     973   30     190

In [14]:
df_excel['new_var']=df_excel['age']/10

In [15]:
df_excel.head(3)

      name  income  age  height  new_var
0      Bob     968   60     170      6.0
1  Jessica     155   40     166      4.0
2     Mary      77   35     183      3.5

In [16]:
df_excel[2:4]

   name  income  age  height  new_var
2  Mary      77   35     183      3.5
3  John     578   55     150      5.5

In [17]:
df_excel[df_excel.age>40]

   name  income  age  height  new_var
0   Bob     968   60     170      6.0
3  John     578   55     150      5.5

In [18]:
df_excel[df_excel.name=='jessica']

Empty DataFrame
Columns: [name, income, age, height, new_var]
Index: []

In [19]:
df_excel[(df_excel.age>30)&(df_excel.height>150)]

      name  income  age  height  new_var
0      Bob     968   60     170      6.0
1  Jessica     155   40     166      4.0
2     Mary      77   35     183      3.5

In [20]:
import numpy as np

In [21]:
f=lambda x : -x
f2=lambda x:x*x
f3=lambda x:np.sqrt(x)

In [22]:
df_excel['minus_age']=df_excel.age.apply(f)

In [23]:
df_excel['square']=df_excel.age.apply(f2)

In [24]:
df_excel['range']=df_excel.age.apply(f3)

In [25]:
df_excel

      name  income  age  height  new_var  minus_age  square     range
0      Bob     968   60     170      6.0        -60    3600  7.745967
1  Jessica     155   40     166      4.0        -40    1600  6.324555
2     Mary      77   35     183      3.5        -35    1225  5.916080
3     John     578   55     150      5.5        -55    3025  7.416198
4      Mel     973   30     190      3.0        -30     900  5.477226

In [26]:
def more_than_40(x):
    if x>40:
        return 1
    else:
        return 0

In [27]:
f4=lambda x: more_than_40(x)

In [28]:
df_excel['over40']=df_excel.age.apply(f4)

In [29]:
df_excel[df_excel.over40 == 1][['income','height']]

   income  height
0     968     170
3     578     150